
<template>
  <div class="wrap_t">
    <div class="header">
      <p>
        累计运行次数：
        <span>2536</span>
      </p>
      <p>业务协同标准化服务平台</p>
      <p>{{ date }}</p>
    </div>
    <div class="wrap">
      <div class="content">
        <div class="content_top">
          <img src alt />
          <p>微服务1</p>
        </div>
        <div class="content_cen">
          <p>
            累计运行时间：
            <span>30天5小时26分</span>
          </p>
          <p>
            累计就诊次数：
            <span>256553</span>
          </p>
        </div>
        <div class="content_bot_s">
          <ul>
            <li @click="choose(item)" v-for="(item,index) in dateLine" :key="index">{{item}}</li>
          </ul>
        </div>
      </div>
      <div class="main">
        <div class="main_left">
          <div class="main_left_top">
            <p>微服务服务请求次数柱状图</p>
          </div>
          <div class="main_left_cen">
            <ve-histogram height="780px" :data="chartData" :settings="chartSettings"></ve-histogram>
          </div>
        </div>
        <div class="main_right">
          <div class="main_right_cen">
            <div class="main_right_top">
              <p>服务请求次数柱状图</p>
            </div>
            <div class="main_right_cen_t">
              <swiper :options="swiperOption" ref="mySwiper" @someSwiperEvent="callback">
                <swiper-slide>
                  <ve-histogram :data="RigChart"></ve-histogram>
                </swiper-slide>
                <swiper-slide>
                  <ve-histogram :data="RigChart1"></ve-histogram>
                </swiper-slide>
                <swiper-slide>
                  <ve-histogram :data="RigChart2"></ve-histogram>
                </swiper-slide>
                <div class="swiper-pagination" slot="pagination"></div>
              </swiper>
              <!-- <ve-histogram :data="RigChart"></ve-histogram> -->
            </div>
          </div>

          <div class="main_right_cen_b">
            <div class="main_right_b_left">
              <p>
                累计服务请求次数：
                <span>256553</span>
              </p>
              <p>
                累计运行时间：
                <span>30天5小时26分</span>
              </p>
            </div>
            <div class="main_right_b_right">
              <div class="main_bot_title">
                <p>不同服务请求次数分布饼图</p>
              </div>
              <div class="main_bot_pie">
                <ve-pie class="pie" :data="RigPieData"></ve-pie>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
let moment = require('moment');
import { swiper, swiperSlide } from 'vue-awesome-swiper'

export default {
  name: 'secplat',
  components: {
    swiper, swiperSlide
  },
  data() {
    this.chartSettings = {
      stack: { '服务': ['服务1', '服务2', '服务3', '服务4', '服务5'] },
    }
    return {
      date: null,
      chartData: {
        columns: [],
        rows: []
      },
      RigChart: {
        columns: [],
        rows: []
      },
      RigChart1: {
        columns: [],
        row: []
      },
      RigChart2: {
        columns: [],
        row: []
      },
      RigPieData: {
        columns: [],
        rows: []
      },
      DateDatum:
      {
        day: {
          columns: ['时间', '服务1', '服务2', '服务3', '服务4', '服务5'],
          moreColg: [
            { '时间': '00:00', '服务1': 1393, '服务2': 1093, '服务3': 1723, '服务4': 2763, '服务5': 3573 },
            { '时间': '01:00', '服务1': 3530, '服务2': 3230, '服务3': 2923, '服务4': 4513, '服务5': 1093 },
            { '时间': '02:00', '服务1': 2923, '服务2': 2623, '服务3': 5293, '服务4': 6763, '服务5': 4523 },
            { '时间': '03:00', '服务1': 1723, '服务2': 1423, '服务3': 3573, '服务4': 5873, '服务5': 1298 },
            { '时间': '04:00', '服务1': 3792, '服务2': 3492, '服务3': 1533, '服务4': 2623, '服务5': 3792 },
            { '时间': '05:00', '服务1': 5293, '服务2': 2512, '服务3': 2512, '服务4': 7923, '服务5': 3583 },
            { '时间': '06:00', '服务1': 4593, '服务2': 3523, '服务3': 1298, '服务4': 2123, '服务5': 2553 },
            { '时间': '07:00', '服务1': 3683, '服务2': 5863, '服务3': 1977, '服务4': 1723, '服务5': 3343 },
            { '时间': '08:00', '服务1': 2273, '服务2': 1723, '服务3': 1393, '服务4': 2923, '服务5': 1723 },
            { '时间': '09:00', '服务1': 5903, '服务2': 1423, '服务3': 6443, '服务4': 3653, '服务5': 3523 },
            { '时间': '10:00', '服务1': 3573, '服务2': 6443, '服务3': 3792, '服务4': 5593, '服务5': 5623 },
            { '时间': '11:00', '服务1': 1523, '服务2': 3792, '服务3': 3583, '服务4': 2693, '服务5': 3792 },
            { '时间': '12:00', '服务1': 4523, '服务2': 3523, '服务3': 3343, '服务4': 4763, '服务5': 5863 },
            { '时间': '13:00', '服务1': 6443, '服务2': 1093, '服务3': 2553, '服务4': 7624, '服务5': 2763 },
            { '时间': '14:00', '服务1': 2553, '服务2': 1298, '服务3': 4523, '服务4': 3523, '服务5': 1523 },
            { '时间': '15:00', '服务1': 1533, '服务2': 3792, '服务3': 1523, '服务4': 2823, '服务5': 1298 },
            { '时间': '16:00', '服务1': 3583, '服务2': 1977, '服务3': 5293, '服务4': 6523, '服务5': 3683 },
            { '时间': '06:00', '服务1': 4593, '服务2': 4523, '服务3': 1298, '服务4': 1023, '服务5': 1723 },
            { '时间': '17:00', '服务1': 2763, '服务2': 3530, '服务3': 1723, '服务4': 3456, '服务5': 1533 },
            { '时间': '18:00', '服务1': 3572, '服务2': 4293, '服务3': 3530, '服务4': 5623, '服务5': 1423 },
            { '时间': '19:00', '服务1': 2512, '服务2': 1298, '服务3': 1977, '服务4': 6543, '服务5': 5903 },
            { '时间': '20:00', '服务1': 1977, '服务2': 3456, '服务3': 4593, '服务4': 2215, '服务5': 1723 },
            { '时间': '21:00', '服务1': 3343, '服务2': 2215, '服务3': 2512, '服务4': 5863, '服务5': 6443 },
            { '时间': '22:00', '服务1': 1298, '服务2': 1568, '服务3': 3572, '服务4': 1568, '服务5': 4593 },
            { '时间': '23:00', '服务1': 4593, '服务2': 4293, '服务3': 2763, '服务4': 2990, '服务5': 3792 },
          ]
        },
        week: {
          columns: ['时间', '服务1', '服务2', '服务3', '服务4', '服务5'],
          moreColg: [
            { '时间': '周一', '服务1': 2393, '服务2': 2093, '服务3': 2723, '服务4': 4763, '服务5': 5573 },
            { '时间': '周二', '服务1': 4530, '服务2': 4230, '服务3': 3923, '服务4': 5513, '服务5': 2093 },
            { '时间': '周三', '服务1': 3923, '服务2': 3623, '服务3': 6293, '服务4': 7763, '服务5': 5523 },
            { '时间': '周四', '服务1': 2723, '服务2': 2423, '服务3': 4573, '服务4': 6873, '服务5': 1298 },
            { '时间': '周五', '服务1': 4792, '服务2': 4492, '服务3': 2533, '服务4': 3623, '服务5': 4792 },
            { '时间': '周六', '服务1': 6293, '服务2': 3512, '服务3': 3512, '服务4': 8923, '服务5': 4583 },
            { '时间': '周日', '服务1': 5593, '服务2': 4523, '服务3': 2298, '服务4': 3123, '服务5': 3553 },
          ]
        },
        month: {
          columns: ['时间', '服务1', '服务2', '服务3', '服务4', '服务5'],
          moreColg: [
            { '时间': '1号', '服务1': 3393, '服务2': 3093, '服务3': 3723, '服务4': 5763, '服务5': 6573 },
            { '时间': '2号', '服务1': 5530, '服务2': 5230, '服务3': 4923, '服务4': 6513, '服务5': 3093 },
            { '时间': '3号', '服务1': 4923, '服务2': 4623, '服务3': 4293, '服务4': 8763, '服务5': 4523 },
            { '时间': '4号', '服务1': 3523, '服务2': 3423, '服务3': 5573, '服务4': 7873, '服务5': 2298 },
            { '时间': '5号', '服务1': 5692, '服务2': 5492, '服务3': 3533, '服务4': 4623, '服务5': 5792 },
            { '时间': '6号', '服务1': 7293, '服务2': 1512, '服务3': 4512, '服务4': 9923, '服务5': 5583 },
            { '时间': '7号', '服务1': 6593, '服务2': 4523, '服务3': 3298, '服务4': 4123, '服务5': 4553 },
            { '时间': '8号', '服务1': 5683, '服务2': 5863, '服务3': 3277, '服务4': 3723, '服务5': 5343 },
            { '时间': '9号', '服务1': 4273, '服务2': 6723, '服务3': 3393, '服务4': 2923, '服务5': 3723 },
            { '时间': '10号', '服务1': 7903, '服务2': 2423, '服务3': 8443, '服务4': 5653, '服务5': 5523 },
            { '时间': '11号', '服务1': 5573, '服务2': 4443, '服务3': 5792, '服务4': 7593, '服务5': 7623 },
            { '时间': '12号', '服务1': 3523, '服务2': 8792, '服务3': 5583, '服务4': 4693, '服务5': 5792 },
            { '时间': '13号', '服务1': 6523, '服务2': 5523, '服务3': 5343, '服务4': 6763, '服务5': 7863 },
            { '时间': '14号', '服务1': 8443, '服务2': 4093, '服务3': 4553, '服务4': 9624, '服务5': 4763 },
            { '时间': '15号', '服务1': 4553, '服务2': 3298, '服务3': 6523, '服务4': 5523, '服务5': 3523 },
            { '时间': '16号', '服务1': 1533, '服务2': 5792, '服务3': 3523, '服务4': 4823, '服务5': 3298 },
            { '时间': '17号', '服务1': 6583, '服务2': 4977, '服务3': 7293, '服务4': 8523, '服务5': 5683 },
            { '时间': '18号', '服务1': 5593, '服务2': 6523, '服务3': 3298, '服务4': 3023, '服务5': 3723 },
            { '时间': '19号', '服务1': 5763, '服务2': 5530, '服务3': 3723, '服务4': 5456, '服务5': 3533 },
            { '时间': '20号', '服务1': 9572, '服务2': 4293, '服务3': 5530, '服务4': 7623, '服务5': 3423 },
            { '时间': '21号', '服务1': 4512, '服务2': 3298, '服务3': 3977, '服务4': 8543, '服务5': 7903 },
            { '时间': '22号', '服务1': 3977, '服务2': 5456, '服务3': 6593, '服务4': 2215, '服务5': 3723 },
            { '时间': '23号', '服务1': 2343, '服务2': 4215, '服务3': 5512, '服务4': 7863, '服务5': 8443 },
            { '时间': '24号', '服务1': 8298, '服务2': 3568, '服务3': 6572, '服务4': 3568, '服务5': 6593 },
            { '时间': '25号', '服务1': 6593, '服务2': 6293, '服务3': 4763, '服务4': 4990, '服务5': 5792 },
            { '时间': '26号', '服务1': 5593, '服务2': 6593, '服务3': 5763, '服务4': 5850, '服务5': 6792 },
            { '时间': '27号', '服务1': 6593, '服务2': 7293, '服务3': 6763, '服务4': 6790, '服务5': 5812 },
            { '时间': '28号', '服务1': 8593, '服务2': 8293, '服务3': 5563, '服务4': 5790, '服务5': 2892 },
            { '时间': '29号', '服务1': 5423, '服务2': 7293, '服务3': 2563, '服务4': 3290, '服务5': 2492 },
            { '时间': '30号', '服务1': 7563, '服务2': 5293, '服务3': 4763, '服务4': 2190, '服务5': 3692 },

          ]

        },
        year: {
          columns: ['时间', '服务1', '服务2', '服务3', '服务4', '服务5'],
          moreColg: [
            { '时间': '1月', '服务1': 4393, '服务2': 2093, '服务3': 4723, '服务4': 6763, '服务5': 7573 },
            { '时间': '2月', '服务1': 6530, '服务2': 5230, '服务3': 5923, '服务4': 7513, '服务5': 4093 },
            { '时间': '3月', '服务1': 5923, '服务2': 5623, '服务3': 5293, '服务4': 9763, '服务5': 5523 },
            { '时间': '4月', '服务1': 4523, '服务2': 4523, '服务3': 6573, '服务4': 8873, '服务5': 3298 },
            { '时间': '5月', '服务1': 6692, '服务2': 6492, '服务3': 4533, '服务4': 5623, '服务5': 6792 },
            { '时间': '6月', '服务1': 6693, '服务2': 2512, '服务3': 5512, '服务4': 5923, '服务5': 6583 },
            { '时间': '7月', '服务1': 5593, '服务2': 5523, '服务3': 4298, '服务4': 5523, '服务5': 5553 },
            { '时间': '8月', '服务1': 4683, '服务2': 6863, '服务3': 4277, '服务4': 4723, '服务5': 6343 },
            { '时间': '9月', '服务1': 5273, '服务2': 7723, '服务3': 4393, '服务4': 3923, '服务5': 4723 },
            { '时间': '10月', '服务1': 8903, '服务2': 3423, '服务3': 9443, '服务4': 6653, '服务5': 6523 },
            { '时间': '11月', '服务1': 6573, '服务2': 5443, '服务3': 6792, '服务4': 8593, '服务5': 8623 },
            { '时间': '12月', '服务1': 4523, '服务2': 9792, '服务3': 6583, '服务4': 5693, '服务5': 6792 }
          ]
        }
      },
      RigDate: {
        day: {
          columns: ['服务', '请求次数'],
          pieNum: [
            { '服务': '服务1', '请求次数': 1393 },
            { '服务': '服务2', '请求次数': 3530 },
            { '服务': '服务3', '请求次数': 2923 },
            { '服务': '服务4', '请求次数': 1723 },
            { '服务': '服务5', '请求次数': 3792 },
            // { '服务': '服务6', '请求次数': 4593},
            // { '服务': '服务7', '请求次数': 8593},
            // { '服务': '服务8', '请求次数': 6592},
            // { '服务': '服务9', '请求次数': 2963},
            // { '服务': '服务10', '请求次数': 3993}
          ]
        },
        week: {
          columns: ['服务', '请求次数'],
          pieNum: [
            { '服务': '服务1', '请求次数': 2393 },
            { '服务': '服务2', '请求次数': 4530 },
            { '服务': '服务3', '请求次数': 3923 },
            { '服务': '服务4', '请求次数': 2723 },
            { '服务': '服务5', '请求次数': 4792 },
            // { '服务': '服务6', '请求次数': 5593},
            // { '服务': '服务7', '请求次数': 7593},
            // { '服务': '服务8', '请求次数': 7592},
            // { '服务': '服务9', '请求次数': 3963},
            // { '服务': '服务10', '请求次数': 4993}
          ]
        },
        month: {
          columns: ['服务', '请求次数'],
          pieNum: [
            { '服务': '服务1', '请求次数': 3393 },
            { '服务': '服务2', '请求次数': 5530 },
            { '服务': '服务3', '请求次数': 4923 },
            { '服务': '服务4', '请求次数': 3723 },
            { '服务': '服务5', '请求次数': 5792 },
            // { '服务': '服务6', '请求次数': 6593},
            // { '服务': '服务7', '请求次数': 8593},
            // { '服务': '服务8', '请求次数': 8592},
            // { '服务': '服务9', '请求次数': 4963},
            // { '服务': '服务10', '请求次数': 5993}
          ]
        },
        year: {
          columns: ['服务', '请求次数'],
          pieNum: [
            { '服务': '服务1', '请求次数': 4393 },
            { '服务': '服务2', '请求次数': 6530 },
            { '服务': '服务3', '请求次数': 5923 },
            { '服务': '服务4', '请求次数': 4723 },
            { '服务': '服务5', '请求次数': 6792 },
            // { '服务': '服务6', '请求次数': 7593},
            // { '服务': '服务7', '请求次数': 9593},
            // { '服务': '服务8', '请求次数': 9592},
            // { '服务': '服务9', '请求次数': 5963},
            // { '服务': '服务10', '请求次数': 6993}
          ]
        }
      },
      AllCol: {
        day: {
          columns: ['时间', '请求次数'],
          moreColg: [
            { '时间': '00:00', '请求次数': 1393, },
            { '时间': '01:00', '请求次数': 3530, },
            { '时间': '02:00', '请求次数': 2923, },
            { '时间': '03:00', '请求次数': 1723, },
            { '时间': '04:00', '请求次数': 3792, },
            { '时间': '05:00', '请求次数': 5293, },
            { '时间': '06:00', '请求次数': 4593, },
            { '时间': '07:00', '请求次数': 3683, },
            { '时间': '08:00', '请求次数': 2273, },
            { '时间': '09:00', '请求次数': 5903, },
            { '时间': '10:00', '请求次数': 3573, },
            { '时间': '11:00', '请求次数': 1523, },
            { '时间': '12:00', '请求次数': 4523, },
            { '时间': '13:00', '请求次数': 6443, },
            { '时间': '14:00', '请求次数': 2553, },
            { '时间': '15:00', '请求次数': 1533, },
            { '时间': '16:00', '请求次数': 3583, },
            { '时间': '06:00', '请求次数': 4593, },
            { '时间': '17:00', '请求次数': 2763, },
            { '时间': '18:00', '请求次数': 3572, },
            { '时间': '19:00', '请求次数': 2512, },
            { '时间': '20:00', '请求次数': 1977, },
            { '时间': '21:00', '请求次数': 3343, },
            { '时间': '22:00', '请求次数': 1298, },
            { '时间': '23:00', '请求次数': 4593, },
          ],
          moreColg1: [
            { '时间': '00:00', '请求次数': 1093, },
            { '时间': '01:00', '请求次数': 3230, },
            { '时间': '02:00', '请求次数': 2623, },
            { '时间': '03:00', '请求次数': 1423, },
            { '时间': '04:00', '请求次数': 3492, },
            { '时间': '05:00', '请求次数': 2512, },
            { '时间': '06:00', '请求次数': 3523, },
            { '时间': '07:00', '请求次数': 5863, },
            { '时间': '08:00', '请求次数': 1723, },
            { '时间': '09:00', '请求次数': 1423, },
            { '时间': '10:00', '请求次数': 6443, },
            { '时间': '11:00', '请求次数': 3792, },
            { '时间': '12:00', '请求次数': 3523, },
            { '时间': '13:00', '请求次数': 1093, },
            { '时间': '14:00', '请求次数': 1298, },
            { '时间': '15:00', '请求次数': 3792, },
            { '时间': '16:00', '请求次数': 1977, },
            { '时间': '06:00', '请求次数': 4523, },
            { '时间': '17:00', '请求次数': 3530, },
            { '时间': '18:00', '请求次数': 4293, },
            { '时间': '19:00', '请求次数': 1298, },
            { '时间': '20:00', '请求次数': 3456, },
            { '时间': '21:00', '请求次数': 2215, },
            { '时间': '22:00', '请求次数': 1568, },
            { '时间': '23:00', '请求次数': 4293, },
          ],
          moreColg2: [
            { '时间': '00:00', '请求次数': 1723, },
            { '时间': '01:00', '请求次数': 2923, },
            { '时间': '02:00', '请求次数': 5293, },
            { '时间': '03:00', '请求次数': 3573, },
            { '时间': '04:00', '请求次数': 1533, },
            { '时间': '05:00', '请求次数': 2512, },
            { '时间': '06:00', '请求次数': 1298, },
            { '时间': '07:00', '请求次数': 1977, },
            { '时间': '08:00', '请求次数': 1393, },
            { '时间': '09:00', '请求次数': 6443, },
            { '时间': '10:00', '请求次数': 3792, },
            { '时间': '11:00', '请求次数': 3583, },
            { '时间': '12:00', '请求次数': 3343, },
            { '时间': '13:00', '请求次数': 2553, },
            { '时间': '14:00', '请求次数': 4523, },
            { '时间': '15:00', '请求次数': 1523, },
            { '时间': '16:00', '请求次数': 5293, },
            { '时间': '06:00', '请求次数': 1298, },
            { '时间': '17:00', '请求次数': 1723, },
            { '时间': '18:00', '请求次数': 3530, },
            { '时间': '19:00', '请求次数': 1977, },
            { '时间': '20:00', '请求次数': 4593, },
            { '时间': '21:00', '请求次数': 2512, },
            { '时间': '22:00', '请求次数': 3572, },
            { '时间': '23:00', '请求次数': 2763, },
          ]
        },
        week: {
          columns: ['时间', '请求次数'],
          moreColg: [
            { '时间': '周一', '请求次数': 2393, },
            { '时间': '周二', '请求次数': 4530, },
            { '时间': '周三', '请求次数': 3923, },
            { '时间': '周四', '请求次数': 2723, },
            { '时间': '周五', '请求次数': 4792, },
            { '时间': '周六', '请求次数': 6293, },
            { '时间': '周日', '请求次数': 5593, },
          ],
          moreColg1: [
            { '时间': '周一', '请求次数': 2093, },
            { '时间': '周二', '请求次数': 4230, },
            { '时间': '周三', '请求次数': 3623, },
            { '时间': '周四', '请求次数': 2423, },
            { '时间': '周五', '请求次数': 4492, },
            { '时间': '周六', '请求次数': 3512, },
            { '时间': '周日', '请求次数': 4523, },
          ],
          moreColg2: [
            { '时间': '周一', '请求次数': 2723 },
            { '时间': '周二', '请求次数': 3923, },
            { '时间': '周三', '请求次数': 6293, },
            { '时间': '周四', '请求次数': 4573, },
            { '时间': '周五', '请求次数': 2533, },
            { '时间': '周六', '请求次数': 3512, },
            { '时间': '周日', '请求次数': 2298, },
          ]
        },
        month: {
          columns: ['时间', '请求次数'],
          moreColg: [
            { '时间': '1号', '请求次数': 3393, },
            { '时间': '2号', '请求次数': 5530, },
            { '时间': '3号', '请求次数': 4923, },
            { '时间': '4号', '请求次数': 3523, },
            { '时间': '5号', '请求次数': 5692, },
            { '时间': '6号', '请求次数': 7293, },
            { '时间': '7号', '请求次数': 6593, },
            { '时间': '8号', '请求次数': 5683, },
            { '时间': '9号', '请求次数': 4273, },
            { '时间': '10号', '请求次数': 7903, },
            { '时间': '11号', '请求次数': 5573, },
            { '时间': '12号', '请求次数': 3523, },
            { '时间': '13号', '请求次数': 6523, },
            { '时间': '14号', '请求次数': 8443, },
            { '时间': '15号', '请求次数': 4553, },
            { '时间': '16号', '请求次数': 1533, },
            { '时间': '17号', '请求次数': 6583, },
            { '时间': '18号', '请求次数': 5593, },
            { '时间': '19号', '请求次数': 5763, },
            { '时间': '20号', '请求次数': 9572, },
            { '时间': '21号', '请求次数': 4512, },
            { '时间': '22号', '请求次数': 3977, },
            { '时间': '23号', '请求次数': 2343, },
            { '时间': '24号', '请求次数': 8298, },
            { '时间': '25号', '请求次数': 6593, },
            { '时间': '26号', '请求次数': 5593, },
            { '时间': '27号', '请求次数': 6593, },
            { '时间': '28号', '请求次数': 8593, },
            { '时间': '29号', '请求次数': 5423, },
            { '时间': '30号', '请求次数': 7563, },
          ],
          moreColg1: [
            { '时间': '1号', '请求次数': 3093, },
            { '时间': '2号', '请求次数': 5230, },
            { '时间': '3号', '请求次数': 4623, },
            { '时间': '4号', '请求次数': 3423, },
            { '时间': '5号', '请求次数': 5492, },
            { '时间': '6号', '请求次数': 1512, },
            { '时间': '7号', '请求次数': 4523, },
            { '时间': '8号', '请求次数': 5863, },
            { '时间': '9号', '请求次数': 6723, },
            { '时间': '10号', '请求次数': 2423, },
            { '时间': '11号', '请求次数': 4443, },
            { '时间': '12号', '请求次数': 8792, },
            { '时间': '13号', '请求次数': 5523, },
            { '时间': '14号', '请求次数': 4093, },
            { '时间': '15号', '请求次数': 3298, },
            { '时间': '16号', '请求次数': 5792, },
            { '时间': '17号', '请求次数': 4977, },
            { '时间': '18号', '请求次数': 6523, },
            { '时间': '19号', '请求次数': 5530, },
            { '时间': '20号', '请求次数': 4293, },
            { '时间': '21号', '请求次数': 3298, },
            { '时间': '22号', '请求次数': 5456, },
            { '时间': '23号', '请求次数': 4215, },
            { '时间': '24号', '请求次数': 3568, },
            { '时间': '25号', '请求次数': 6293, },
            { '时间': '26号', '请求次数': 6593, },
            { '时间': '27号', '请求次数': 7293, },
            { '时间': '28号', '请求次数': 8293, },
            { '时间': '29号', '请求次数': 7293, },
            { '时间': '30号', '请求次数': 5293, },

          ],
          moreColg2: [
            { '时间': '1号', '请求次数': 3723, },
            { '时间': '2号', '请求次数': 4923, },
            { '时间': '3号', '请求次数': 4293, },
            { '时间': '4号', '请求次数': 5573, },
            { '时间': '5号', '请求次数': 3533, },
            { '时间': '6号', '请求次数': 4512, },
            { '时间': '7号', '请求次数': 3298, },
            { '时间': '8号', '请求次数': 3277, },
            { '时间': '9号', '请求次数': 3393, },
            { '时间': '10号', '请求次数': 8443, },
            { '时间': '11号', '请求次数': 5792, },
            { '时间': '12号', '请求次数': 5583, },
            { '时间': '13号', '请求次数': 5343, },
            { '时间': '14号', '请求次数': 4553, },
            { '时间': '15号', '请求次数': 6523, },
            { '时间': '16号', '请求次数': 3523, },
            { '时间': '17号', '请求次数': 7293, },
            { '时间': '18号', '请求次数': 3298, },
            { '时间': '19号', '请求次数': 3723, },
            { '时间': '20号', '请求次数': 5530, },
            { '时间': '21号', '请求次数': 3977, },
            { '时间': '22号', '请求次数': 6593, },
            { '时间': '23号', '请求次数': 5512, },
            { '时间': '24号', '请求次数': 6572, },
            { '时间': '25号', '请求次数': 4763, },
            { '时间': '26号', '请求次数': 5763, },
            { '时间': '27号', '请求次数': 6763, },
            { '时间': '28号', '请求次数': 5563, },
            { '时间': '29号', '请求次数': 2563, },
            { '时间': '30号', '请求次数': 4763, },

          ]

        },
        year: {
          columns: ['时间', '请求次数'],
          moreColg: [
            { '时间': '1月', '请求次数': 4393, },
            { '时间': '2月', '请求次数': 6530, },
            { '时间': '3月', '请求次数': 5923, },
            { '时间': '4月', '请求次数': 4523, },
            { '时间': '5月', '请求次数': 6692, },
            { '时间': '6月', '请求次数': 6693, },
            { '时间': '7月', '请求次数': 5593, },
            { '时间': '8月', '请求次数': 4683, },
            { '时间': '9月', '请求次数': 5273, },
            { '时间': '10月', '请求次数': 8903, },
            { '时间': '11月', '请求次数': 6573, },
            { '时间': '12月', '请求次数': 4523, }
          ],
          moreColg1: [
            { '时间': '1月', '请求次数': 2093, },
            { '时间': '2月', '请求次数': 5230, },
            { '时间': '3月', '请求次数': 5623, },
            { '时间': '4月', '请求次数': 4523, },
            { '时间': '5月', '请求次数': 6492, },
            { '时间': '6月', '请求次数': 2512, },
            { '时间': '7月', '请求次数': 5523, },
            { '时间': '8月', '请求次数': 6863, },
            { '时间': '9月', '请求次数': 7723, },
            { '时间': '10月', '请求次数': 3423, },
            { '时间': '11月', '请求次数': 5443, },
            { '时间': '12月', '请求次数': 9792, }
          ],
          moreColg2: [
            { '时间': '1月', '请求次数': 4723 },
            { '时间': '2月', '请求次数': 5923, },
            { '时间': '3月', '请求次数': 5293, },
            { '时间': '4月', '请求次数': 6573, },
            { '时间': '5月', '请求次数': 4533, },
            { '时间': '6月', '请求次数': 5512, },
            { '时间': '7月', '请求次数': 4298, },
            { '时间': '8月', '请求次数': 4277, },
            { '时间': '9月', '请求次数': 4393, },
            { '时间': '10月', '请求次数': 9443, },
            { '时间': '11月', '请求次数': 6792, },
            { '时间': '12月', '请求次数': 6583, }
          ]
        }
      },
      swiperOption: {
        autoplay: {
          delay: 3000,
          disableOnInteraction: false,
        },
        loopedSlides: 3,
        pagination: {
          el: '.swiper-pagination',
          clickable: true,
          renderBullet: function (index, className) {
            let label = ['实例1', '实例2', '实例3']
            return '<span class="' + className + '">' + label[index] + '</span>';
          }
        }
      },
      dateLine: ['今日', '本周', '本月', '本年', '自定义时间段']
    }
  },
  mounted() {
    setInterval(() => {
      this.date = moment().format('YYYY-MM-DD  hh:mm:ss');
    }, 1000);
    this.chartData.columns = this.DateDatum.day.columns
    this.chartData.rows = this.DateDatum.day.moreColg
    this.RigPieData.rows = this.RigDate.day.pieNum
    this.RigPieData.columns = this.RigDate.day.columns

    this.RigChart.rows = this.AllCol.day.moreColg
    this.RigChart.columns = this.AllCol.day.columns

    this.RigChart1.rows = this.AllCol.day.moreColg1
    this.RigChart1.columns = this.AllCol.day.columns

    this.RigChart2.rows = this.AllCol.day.moreColg2
    this.RigChart2.columns = this.AllCol.day.columns

    this.init()
  },
  methods: {
    init() {

    },
    toLogin() {
      sessionStorage.clear()
      // window.location.reload()
      this.$router.push({        name: "login", query: {
          from: "secplat"
        }      })
    },
    callback() { },
    toManangerment() {
      let str = window.location.href
      let num = str.indexOf("?");
      str = str.substr(num + 1);
      console.log(str)
      window.location.href = '../../main/index.html?' + str
    },
    choose(item) {
      switch (item) {
        case '今日':
          this.chartData.columns = this.DateDatum.day.columns
          this.chartData.rows = this.DateDatum.day.moreColg
          this.RigPieData.rows = this.RigDate.day.pieNum
          this.RigPieData.columns = this.RigDate.day.columns

          this.RigChart.rows = this.AllCol.day.moreColg
          this.RigChart.columns = this.AllCol.day.columns

          this.RigChart1.rows = this.AllCol.day.moreColg1
          this.RigChart1.columns = this.AllCol.day.columns
          this.RigChart2.columns = this.AllCol.day.columns
          this.RigChart2.rows = this.AllCol.day.moreColg2

          break;
        case '本周':
          this.chartData.columns = this.DateDatum.week.columns
          this.chartData.rows = this.DateDatum.week.moreColg
          this.RigPieData.rows = this.RigDate.week.pieNum
          this.RigPieData.columns = this.RigDate.week.columns

          this.RigChart.rows = this.AllCol.week.moreColg
          this.RigChart.columns = this.AllCol.week.columns

          this.RigChart1.rows = this.AllCol.week.moreColg1
          this.RigChart1.columns = this.AllCol.week.columns

          this.RigChart2.rows = this.AllCol.week.moreColg2
          this.RigChart2.columns = this.AllCol.week.columns

          break;
        case '本月':
          this.chartData.columns = this.DateDatum.month.columns
          this.chartData.rows = this.DateDatum.month.moreColg
          this.RigPieData.rows = this.RigDate.month.pieNum
          this.RigPieData.columns = this.RigDate.month.columns

          this.RigChart.rows = this.AllCol.month.moreColg
          this.RigChart.columns = this.AllCol.month.columns

          this.RigChart1.rows = this.AllCol.month.moreColg1
          this.RigChart2.rows = this.AllCol.month.moreColg2
          this.RigChart1.columns = this.AllCol.month.columns
          this.RigChart2.columns = this.AllCol.month.columns

          break;

        case '本年':
          this.chartData.columns = this.DateDatum.year.columns
          this.chartData.rows = this.DateDatum.year.moreColg
          this.RigPieData.rows = this.RigDate.year.pieNum
          this.RigPieData.columns = this.RigDate.year.columns

          this.RigChart.rows = this.AllCol.year.moreColg
          this.RigChart.columns = this.AllCol.year.columns

          this.RigChart1.rows = this.AllCol.year.moreColg1
          this.RigChart2.rows = this.AllCol.year.moreColg2
          this.RigChart1.columns = this.AllCol.year.columns
          this.RigChart2.columns = this.AllCol.year.columns

          break;

      }
    }
  },

  computed: {
    swiper() {
      return this.$refs.mySwiper.swiper
    }
  }
}
</script>
<style lang='scss' scoped>
.wrap_t {
  width: 100%;
  background-color: #0b0f34;

  .header {
    font-size: 14px;
    color: white;
    overflow: hidden;
    margin-bottom: -1%;
    p {
      float: left;
      margin: 0 auto;
      margin-top: 5px;
    }
    :first-child {
      margin-left: 10%;
      span {
        margin: 0;
      }
    }
    :nth-child(2) {
      margin-left: 26%;
      font-size: 25px;
      font-weight: 700;
    }
    :last-child {
      float: right;
      margin-right: 10%;
    }
  }
}
.wrap {
  width: 100%;
  height: 100%;
  background: url("../assets/images/wrapper-big-bg.png");
  background-size: 100% 100%;

  .content {
    width: 95%;
    margin: 0 auto;
    color: white;
    .content_top {
      overflow: hidden;
      p {
        float: left;
        margin: 3% 0 0 2%;
      }
    }
    .content_cen {
      overflow: hidden;
      margin: 2% 0 0 2%;
      p {
        float: left;
      }
      :first-child {
        span {
          margin: 0;
        }
      }
      :last-child {
        margin-left: 5%;
        span {
          margin: 0;
        }
      }
    }
    .content_bot_s {
      ul {
        overflow: hidden;
        list-style: none;
        margin-top: 2%;
        margin-left: 1%;
        li {
          float: left;
          padding: 0 20px;
          border-right: 1px solid white;
          font-size: 14px;
          cursor: pointer;
        }
        & :hover {
          background-color: aqua;
        }
        :last-child {
          border-right: none;
        }
      }
    }
  }
  .main {
    width: 95%;
    margin: 3% auto 0;
    overflow: hidden;
    .main_left {
      width: 45%;
      background: url("../assets/images/panel-l-t.png");
      background-size: 100% 100%;
      float: left;
      margin-left: 2%;
      .main_left_top {
        background: url("../assets/images/title-bg.png");
        background-size: 100% 100%;
        p {
          margin-left: 5%;
          padding: 5px 0;
          font-size: 16px;
          color: white;
        }
      }
      .main_left_cen {
        margin: 15px 0;
      }
    }
    .main_right {
      width: 40%;
      float: left;
      margin-left: 5%;
      margin-bottom: 15px;
      .main_right_cen {
        background: url("../assets/images/panel-l-t.png");
        background-size: 100% 100%;
        .main_right_top {
          background: url("../assets/images/title-bg.png");
          background-size: 100% 100%;
          p {
            margin-left: 5%;
            padding: 5px 0;
            font-size: 16px;
            color: white;
          }
        }
        .main_right_cen_t {
          color: white;
          .swiper-wrapper {
            margin-top: 50px;
          }
          .swiper-pagination-bullets {
            top: 15px;
          }
          .swiper-pagination-bullet {
            width: 10%;
            height: 20px;
            border-radius: 0;
            float: left;
            background: none;
          }
          .swiper-pagination-bullet-active {
            color: red;
            background: none;
          }
        }
      }

      .main_right_cen_b {
        overflow: hidden;
        .main_right_b_left {
          float: left;
          background: url("../assets/images/panel-r-m.png");
          background-size: 100% 100%;
          margin: 2% 2% 0 0;
          width: 45%;
          font-size: 14px;
          color: white;
          p {
            margin: 10%;
          }
        }
        .main_right_b_right {
          float: right;
          width: 45%;
          margin-top: 2%;
          background: url("../assets/images/panel-r-m.png");
          background-size: 100% 100%;
          margin-bottom: 15px;
          .main_bot_title {
            background: url("../assets/images/title-bg.png");
            background-size: 100% 100%;
            p {
              margin-left: 5%;
              padding: 5px 0;
              font-size: 16px;
              color: white;
            }
          }
          .main_bot_pie {
            width: 100%;
            .pie {
              width: 100% !important;
              height: 322px !important;
              canvas {
                width: 300px !important;
                height: 360px !important;
              }
            }
          }
        }
      }
    }
  }
}
</style>