<template>
  <div class="page_box">
    <div class="tabletop">
      <ul>
        <li></li>
        <li class="lilastone">数据中心</li>
        <li class="lilast">{{date}}</li>
      </ul>
    </div>
    <div class="tableheaderone">
      <div class="tableheaderonea">
        <span class="tableheaderoneas_png">图标</span>
        <span class="tableheaderoneas">数据共享</span>
      </div>
      <div class="tableheaderoneb" @click="toManangerment">管理入口</div>
    </div>
    <div class="tableheadertwo">
      <ul>
        <li>累计运行时间：30天5小时26分</li>
        <li>数据量（数据库/表/记录）：5/325/18656.3万</li>
        <li>共享数据量（目录/记录）：56/235.63万</li>
        <li>共享数据服务次数：3156.3万</li>
        <li>ETL数据量（表/记录）：28/123.3万</li>
      </ul>
    </div>
    <div class="databox">
      <div class="databox_content">
        <!-- page1              -->
        <div class="data_change">
          <span
            class="changebutton_data"
            :class="{ active: checkDataType === 'day' }"
            @click="checkTimeHorizon('day')"
          >今日</span>
          <span
            class="changebutton_data"
            :class="{ active: checkDataType === 'week' }"
            @click="checkTimeHorizon('week')"
          >本周</span>
          <span
            class="changebutton_data"
            :class="{ active: checkDataType === 'month' }"
            @click="checkTimeHorizon('month')"
          >本月</span>
          <span
            class="changebutton_data"
            :class="{ active: checkDataType === 'year' }"
            @click="checkTimeHorizon('year')"
          >本年</span>
          <span class="changebutton_data">自定义时间段</span>
        </div>
        <div class="databox_one">
          <div class="databoxone_left">
            <div class="databoxoneleft_one">
              <ve-line
                :data="chartData01"
                :settings="chartSetting1"
                :textStyle="legend.textStyle"
                :legend="legend"
              ></ve-line>
            </div>
            <div class="databoxoneleft_two">
              <div class="databoxonelefttwo_top">
                <ve-pie
                  height="163px"
                  :data="pieData1.hospital"
                  :legend="legend"
                  :settings="pieSetting"
                ></ve-pie>
              </div>
              <div class="databoxonelefttwo_bottom">
                <ve-pie
                  height="163px"
                  :data="pieData1.card"
                  :legend="legend"
                  :settings="pieSetting"
                ></ve-pie>
              </div>
            </div>
          </div>
          <div class="databoxone_right">
            <div class="databoxoneright_center">
              <ve-histogram
                height="340px"
                :data="chartData01"
                :settings="chartSetting1"
                :textStyle="legend.textStyle"
                :legend="legend"
              ></ve-histogram>
            </div>
          </div>
        </div>
        <!-- page2 -->
        <div class="data_change2">
          <span class="changebutton_data2">今日</span>
          <span
            class="changebutton_data2"
            :class="{ active: checkDataType === 'week' }"
            @click="checkTimeHorizon('week')"
          >本周</span>
          <span
            class="changebutton_data2"
            :class="{ active: checkDataType === 'month' }"
            @click="checkTimeHorizon('month')"
          >本月</span>
          <span
            class="changebutton_data2"
            :class="{ active: checkDataType === 'year' }"
            @click="checkTimeHorizon('year')"
          >本年</span>
          <span class="changebutton_data2">自定义时间段</span>
        </div>
        <div class="databox_two">
          <div class="databoxtwo_left">
            <div class="databoxtwoleft_one">
              <swiper :options="swiperOptionTop" ref="swiperTop">
                <div class="swiper-pagination swiper-pagination-bullets" slot="pagination"></div>
                <swiper-slide class="slide-1">
                  <ve-line :data="chartData02.hos1" :textStyle="legend.textStyle" :legend="legend"></ve-line>
                </swiper-slide>
                <swiper-slide class="slide-2">
                  <ve-line :data="chartData02.hos2" :textStyle="legend.textStyle" :legend="legend"></ve-line>
                </swiper-slide>
                <swiper-slide class="slide-3">
                  <ve-line :data="chartData02.hos3" :textStyle="legend.textStyle" :legend="legend"></ve-line>
                </swiper-slide>
                <swiper-slide class="slide-4">
                  <ve-line :data="chartData02.hos4" :textStyle="legend.textStyle" :legend="legend"></ve-line>
                </swiper-slide>
                <swiper-slide class="slide-5">
                  <ve-line :data="chartData02.hos5" :textStyle="legend.textStyle" :legend="legend"></ve-line>
                </swiper-slide>
                <div class="swiper-pagination swiper-pagination-bullets" slot="pagination"></div>
              </swiper>
            </div>
            <div class="databoxtwoleft_two">
              <div class="databoxtwolefttwo_top">
                <ve-pie
                  height="163px"
                  :data="pieData1.hospital"
                  :legend="legend"
                  :settings="pieSetting"
                ></ve-pie>
              </div>
              <div class="databoxtwolefttwo_bottom">
                <ve-pie
                  height="163px"
                  :data="pieData1.card"
                  :legend="legend"
                  :settings="pieSetting"
                ></ve-pie>
              </div>
            </div>
          </div>
          <div class="databoxtwo_right">
            <div class="databoxtworight_center">
              <div class="databoxtworight_center_header1">
                <span>2019-08-12</span>
                <span>|</span>
                <span>上一天</span>
                <span>|</span>
                <span>下一天</span>
                <span>|</span>
                <span>选择日期</span>
              </div>
              <div class="databoxtworight_center_header2">
                <span>任务1</span>
                <span>|</span>
                <span>任务2</span>
                <span>|</span>
                <span>任务3</span>
                <span>|</span>
                <span>（自动切换）</span>
              </div>
              <div class="databoxtworight_center_header3">
                <swiper :options="swiperOptionTop" ref="swiperTop">
                  <div class="swiper-pagination swiper-pagination-bullets" slot="pagination"></div>
                  <swiper-slide class="slide-1">
                    <ve-histogram
                      :data="chartData02.hos1"
                      :textStyle="legend.textStyle"
                      :legend="legend"
                      height="340px"
                    ></ve-histogram>
                  </swiper-slide>
                  <swiper-slide class="slide-2">
                    <ve-histogram
                      :data="chartData02.hos2"
                      :textStyle="legend.textStyle"
                      :legend="legend"
                      height="340px"
                    ></ve-histogram>
                  </swiper-slide>
                  <swiper-slide class="slide-3">
                    <ve-histogram
                      :data="chartData02.hos3"
                      :textStyle="legend.textStyle"
                      :legend="legend"
                      height="340px"
                    ></ve-histogram>
                  </swiper-slide>
                  <swiper-slide class="slide-4">
                    <ve-histogram
                      :data="chartData02.hos4"
                      :textStyle="legend.textStyle"
                      :legend="legend"
                      height="340px"
                    ></ve-histogram>
                  </swiper-slide>
                  <swiper-slide class="slide-5">
                    <ve-histogram
                      :data="chartData02.hos5"
                      :textStyle="legend.textStyle"
                      :legend="legend"
                      height="340px"
                    ></ve-histogram>
                  </swiper-slide>
                  <!-- <div class="swiper-pagination swiper-pagination-bullets" slot="pagination"></div> -->
                </swiper>
              </div>
            </div>
          </div>
        </div>
        <!-- page3   -->
        <div class="databox_three">
          <div class="databox_three_top">数据库监控</div>
          <div class="databox_three_content">
            <ul class="databox_three_contentheader">
              <li>状态</li>
              <li>数据库</li>
              <li>数据库类型</li>
              <li>节点数</li>
              <li>schema数量</li>
              <li>表/集合数</li>
              <li>数据量</li>
              <li>当前链接数</li>
              <li>进程数</li>
              <li>线程数</li>
              <li>每秒SQL执行次数</li>
              <li>每秒锁次数</li>
              <li>IOPS</li>
              <li>入流速</li>
              <li>出流速</li>
            </ul>
            <ul class="databox_three_contentdata1" v-if="databox3list1">
              <li>{{databox3list1.item01}}</li>
              <li>{{databox3list1.item02}}</li>
              <li>{{databox3list1.item03}}</li>
              <li>{{databox3list1.item04}}</li>
              <li>{{databox3list1.item05}}</li>
              <li>{{databox3list1.item06}}</li>
              <li>{{databox3list1.item07}}</li>
              <li>{{databox3list1.item08}}</li>
              <li>{{databox3list1.item09}}</li>
            </ul>
            <ul class="databox_three_contentdata2" v-if="databox3list2">
              <li>{{databox3list2.item01}}</li>
              <li>{{databox3list2.item02}}</li>
              <li>{{databox3list2.item03}}</li>
              <li>{{databox3list2.item04}}</li>
              <li>{{databox3list2.item05}}</li>
              <li>{{databox3list2.item06}}</li>
              <li>{{databox3list2.item07}}</li>
              <li>{{databox3list2.item08}}</li>
              <li>{{databox3list2.item09}}</li>
            </ul>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import axios from 'axios'
let moment = require('moment');
export default {
  methods: {
    checkTimeHorizon(time) {
      this.checkDataType = time;
      this.chartData01 = this.data01[time];
      this.pieData1.hospital = this.data02.hos_num_pie[time];
      this.pieData1.card = this.data02.card_num_pie[time];
      this.chartData02 = {
        hos1: this.hos_bar_data.hos1Data[time],
        hos2: this.hos_bar_data.hos2Data[time],
        hos3: this.hos_bar_data.hos3Data[time],
        hos4: this.hos_bar_data.hos4Data[time],
        hos5: this.hos_bar_data.hos5Data[time]
      };
    },
    toManangerment() {
      let str = window.location.href
      let num = str.indexOf("?");
      str = str.substr(num + 1);
      console.log(str)
      window.location.href = '../../main/index.html?' + str
    },
    toLogin() {
      sessionStorage.clear()
      // window.location.reload()
      this.$router.push({        name: "login", query: {
          from: "onecard"
        }      })
    },
    getData() {
      let params = {
        "serviceName": "srvetl_job_history_select",
        "colNames": ["*"],
        "condition": [
          {
            "colName": "start_time",
            "ruleType": "between",
            "value": "2018-02-26 00:00:00, 2019-03-25 00:00:00"
          }
        ],
        "page": {
          "pageNo": 1,
          "rownumber": 2
        }
      }
      axios.post(
        'http://192.168.0.192:8101/datacenter/select/srvetl_job_history_select', params, { headers: { bx_auth_ticket: sessionStorage.getItem("bx_auth_ticket") } }
      ).then(res => {
        console.log(res)
      }).catch(err => {
        console.log(err)
      })
    }
  },
  data() {
    this.pieSetting = {
      radius: 40,
      offsetY: 100,
    };
    this.pieSetting3 = {
      radius: 50,
      offsetY: 120
    };
    return {
      date: null,
      checkDataType: 'day',
      legend: {
        textStyle: {
          color: '#fff',
          fontSize: 10,
        }
      },
      chartSetting1: {
        stack: { 用户: ['延大附院', '市中医医院', '市人民医院', '市妇幼医院', '宝塔区医院'] }
      },
      swiperOptionTop: {
        watchSlidesProgress: true,
        watchSlidesVisibility: true,
        loopedSlides: 5,
        autoplay: {
          delay: 3000,
          disableOnInteraction: false
        },
        //轮播豆豆
        // pagination: {
        //   el: '.swiper-pagination',
        //   clickable: true,
        //   renderBullet(index, className) {
        //     let hospital_name = ['延大附院', '市中医医院', '市人民医院', '市妇幼医院', '宝塔区医院'];
        //     return `<span class="${className} swiper-pagination-bullet-custom">${hospital_name[index]}</span>`;
        //   }
        // }
      },
      chartData01: {},
      pieData1: {
        hospital: {},
        card: {}
      },
      chartData02: {
        hos1: {},
        hos2: {},
        hos3: {},
        hos4: {},
        hos5: {}
      },
      data01: {
        day: {
          columns: ['时间', '延大附院', '市中医医院', '市人民医院', '市妇幼医院', '宝塔区医院'],
          rows: [
            { 时间: '00:00', 延大附院: 5, 市中医医院: 2, 市人民医院: 1, 市妇幼医院: 0, 宝塔区医院: 0 },
            { 时间: '01:00', 延大附院: 3, 市中医医院: 5, 市人民医院: 2, 市妇幼医院: 2, 宝塔区医院: 0 },
            { 时间: '02:00', 延大附院: 1, 市中医医院: 0, 市人民医院: 0, 市妇幼医院: 1, 宝塔区医院: 0 },
            { 时间: '03:00', 延大附院: 2, 市中医医院: 0, 市人民医院: 1, 市妇幼医院: 0, 宝塔区医院: 1 },
            { 时间: '04:00', 延大附院: 2014, 市中医医院: 1423, 市人民医院: 1423, 市妇幼医院: 1423, 宝塔区医院: 0.49 },
            { 时间: '05:00', 延大附院: 4975, 市中医医院: 3492, 市人民医院: 3492, 市妇幼医院: 3492, 宝塔区医院: 0.323 },
            { 时间: '06:00', 延大附院: 4568, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '07:00', 延大附院: 3065, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '08:00', 延大附院: 2589, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '09:00', 延大附院: 4593, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '10:00', 延大附院: 5547, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '11:00', 延大附院: 714, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '12:00', 延大附院: 6520, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '13:00', 延大附院: 987, 市中医医院: 1093, 市人民医院: 1093, 市妇幼医院: 1093, 宝塔区医院: 0.32 },
            { 时间: '14:00', 延大附院: 1982, 市中医医院: 3230, 市人民医院: 3230, 市妇幼医院: 3230, 宝塔区医院: 0.26 },
            { 时间: '15:00', 延大附院: 2923, 市中医医院: 2623, 市人民医院: 2623, 市妇幼医院: 2623, 宝塔区医院: 0.76 },
            { 时间: '16:00', 延大附院: 2456, 市中医医院: 1423, 市人民医院: 1423, 市妇幼医院: 1423, 宝塔区医院: 0.49 },
            { 时间: '17:00', 延大附院: 3792, 市中医医院: 3492, 市人民医院: 3492, 市妇幼医院: 3492, 宝塔区医院: 0.323 },
            { 时间: '18:00', 延大附院: 1514, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '19:00', 延大附院: 2436, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '20:00', 延大附院: 4125, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '21:00', 延大附院: 3201, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '22:00', 延大附院: 2514, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '23:00', 延大附院: 1026, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 }
          ]
        },
        week: {
          columns: ['时间', '延大附院', '市中医医院', '市人民医院', '市妇幼医院', '宝塔区医院'],
          rows: [
            { 时间: '周一', 延大附院: 1234, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '周二', 延大附院: 5851, 市中医医院: 1093, 市人民医院: 1093, 市妇幼医院: 1093, 宝塔区医院: 0.32 },
            { 时间: '周三', 延大附院: 4567, 市中医医院: 3230, 市人民医院: 3230, 市妇幼医院: 3230, 宝塔区医院: 0.26 },
            { 时间: '周四', 延大附院: 4521, 市中医医院: 2623, 市人民医院: 2623, 市妇幼医院: 2623, 宝塔区医院: 0.76 },
            { 时间: '周五', 延大附院: 2014, 市中医医院: 1423, 市人民医院: 1423, 市妇幼医院: 1423, 宝塔区医院: 0.49 },
            { 时间: '周六', 延大附院: 4975, 市中医医院: 3492, 市人民医院: 3492, 市妇幼医院: 3492, 宝塔区医院: 0.323 },
            { 时间: '周日', 延大附院: 4568, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 }
          ]
        },
        month: {
          columns: ['时间', '延大附院', '市中医医院', '市人民医院', '市妇幼医院', '宝塔区医院'],
          rows: [
            { 时间: '1号', 延大附院: 1234, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '2号', 延大附院: 5851, 市中医医院: 1093, 市人民医院: 1093, 市妇幼医院: 1093, 宝塔区医院: 0.32 },
            { 时间: '3号', 延大附院: 4567, 市中医医院: 3230, 市人民医院: 3230, 市妇幼医院: 3230, 宝塔区医院: 0.26 },
            { 时间: '4号', 延大附院: 4521, 市中医医院: 2623, 市人民医院: 2623, 市妇幼医院: 2623, 宝塔区医院: 0.76 },
            { 时间: '5号', 延大附院: 2014, 市中医医院: 1423, 市人民医院: 1423, 市妇幼医院: 1423, 宝塔区医院: 0.49 },
            { 时间: '6号', 延大附院: 4975, 市中医医院: 3492, 市人民医院: 3492, 市妇幼医院: 3492, 宝塔区医院: 0.323 },
            { 时间: '7号', 延大附院: 4568, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '8号', 延大附院: 3065, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '9号', 延大附院: 2589, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '10号', 延大附院: 4593, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '11号', 延大附院: 5547, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '12号', 延大附院: 714, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '13号', 延大附院: 6520, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '14号', 延大附院: 987, 市中医医院: 1093, 市人民医院: 1093, 市妇幼医院: 1093, 宝塔区医院: 0.32 },
            { 时间: '15号', 延大附院: 1982, 市中医医院: 3230, 市人民医院: 3230, 市妇幼医院: 3230, 宝塔区医院: 0.26 },
            { 时间: '16号', 延大附院: 2923, 市中医医院: 2623, 市人民医院: 2623, 市妇幼医院: 2623, 宝塔区医院: 0.76 },
            { 时间: '17号', 延大附院: 2456, 市中医医院: 1423, 市人民医院: 1423, 市妇幼医院: 1423, 宝塔区医院: 0.49 },
            { 时间: '18号', 延大附院: 3792, 市中医医院: 3492, 市人民医院: 3492, 市妇幼医院: 3492, 宝塔区医院: 0.323 },
            { 时间: '19号', 延大附院: 1514, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '20号', 延大附院: 2436, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '21号', 延大附院: 4125, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '22号', 延大附院: 3201, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '23号', 延大附院: 2514, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '24号', 延大附院: 1026, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '25号', 延大附院: 1234, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '26号', 延大附院: 5851, 市中医医院: 1093, 市人民医院: 1093, 市妇幼医院: 1093, 宝塔区医院: 0.32 },
            { 时间: '27号', 延大附院: 4567, 市中医医院: 3230, 市人民医院: 3230, 市妇幼医院: 3230, 宝塔区医院: 0.26 },
            { 时间: '28号', 延大附院: 4521, 市中医医院: 2623, 市人民医院: 2623, 市妇幼医院: 2623, 宝塔区医院: 0.76 },
            { 时间: '29号', 延大附院: 2014, 市中医医院: 1423, 市人民医院: 1423, 市妇幼医院: 1423, 宝塔区医院: 0.49 },
            { 时间: '30号', 延大附院: 4975, 市中医医院: 3492, 市人民医院: 3492, 市妇幼医院: 3492, 宝塔区医院: 0.323 }
          ]
        },
        year: {
          columns: ['时间', '延大附院', '市中医医院', '市人民医院', '市妇幼医院', '宝塔区医院'],
          rows: [
            { 时间: '1月', 延大附院: 1234, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '2月', 延大附院: 5851, 市中医医院: 1093, 市人民医院: 1093, 市妇幼医院: 1093, 宝塔区医院: 0.32 },
            { 时间: '3月', 延大附院: 4567, 市中医医院: 3230, 市人民医院: 3230, 市妇幼医院: 3230, 宝塔区医院: 0.26 },
            { 时间: '4月', 延大附院: 4521, 市中医医院: 2623, 市人民医院: 2623, 市妇幼医院: 2623, 宝塔区医院: 0.76 },
            { 时间: '5月', 延大附院: 2014, 市中医医院: 1423, 市人民医院: 1423, 市妇幼医院: 1423, 宝塔区医院: 0.49 },
            { 时间: '6月', 延大附院: 4975, 市中医医院: 3492, 市人民医院: 3492, 市妇幼医院: 3492, 宝塔区医院: 0.323 },
            { 时间: '7月', 延大附院: 4568, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '8月', 延大附院: 3065, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '9月', 延大附院: 2589, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '10月', 延大附院: 4593, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '11月', 延大附院: 5547, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 },
            { 时间: '12月', 延大附院: 714, 市中医医院: 4293, 市人民医院: 4293, 市妇幼医院: 4293, 宝塔区医院: 0.78 }
          ]
        }
      },
      data02: {
        hos_num_pie: {
          day: {
            columns: ['医院', '访问用户'],
            rows: [
              { 医院: '延大附院', 访问用户: 154 },
              { 医院: '市中医医院', 访问用户: 33 },
              { 医院: '市人民医院', 访问用户: 75 },
              { 医院: '市妇幼医院', 访问用户: 27 },
              { 医院: '宝塔区医院', 访问用户: 19 }
            ]
          },
          week: {
            columns: ['医院', '访问用户'],
            rows: [
              { 医院: '延大附院', 访问用户: 515 },
              { 医院: '市中医医院', 访问用户: 365 },
              { 医院: '市人民医院', 访问用户: 245 },
              { 医院: '市妇幼医院', 访问用户: 147 },
              { 医院: '宝塔区医院', 访问用户: 251 }
            ]
          },
          month: {
            columns: ['医院', '访问用户'],
            rows: [
              { 医院: '延大附院', 访问用户: 2564 },
              { 医院: '市中医医院', 访问用户: 1859 },
              { 医院: '市人民医院', 访问用户: 1574 },
              { 医院: '市妇幼医院', 访问用户: 982 },
              { 医院: '宝塔区医院', 访问用户: 1664 }
            ]
          },
          year: {
            columns: ['医院', '访问用户'],
            rows: [
              { 医院: '延大附院', 访问用户: 15789 },
              { 医院: '市中医医院', 访问用户: 12658 },
              { 医院: '市人民医院', 访问用户: 6598 },
              { 医院: '市妇幼医院', 访问用户: 9852 },
              { 医院: '宝塔区医院', 访问用户: 5698 }
            ]
          }
        },
        card_num_pie: {
          day: {
            columns: ['卡类型', '访问用户'],
            rows: [{ 卡类型: '身份证', 访问用户: 235 }, { 卡类型: '社保卡', 访问用户: 123 }, { 卡类型: '就诊卡', 访问用户: 75 }]
          },
          week: {
            columns: ['卡类型', '访问用户'],
            rows: [{ 卡类型: '身份证', 访问用户: 1235 }, { 卡类型: '社保卡', 访问用户: 1123 }, { 卡类型: '就诊卡', 访问用户: 175 }]
          },
          month: {
            columns: ['卡类型', '访问用户'],
            rows: [{ 卡类型: '身份证', 访问用户: 7235 }, { 卡类型: '社保卡', 访问用户: 7123 }, { 卡类型: '就诊卡', 访问用户: 775 }]
          },
          year: {
            columns: ['卡类型', '访问用户'],
            rows: [{ 卡类型: '身份证', 访问用户: 11235 }, { 卡类型: '社保卡', 访问用户: 11123 }, { 卡类型: '就诊卡', 访问用户: 1175 }]
          }
        }
      },
      hos_bar_data: {
        hos1Data: {
          day: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '00:00', 访问次数: 5 },
              { 时间: '01:00', 访问次数: 0 },
              { 时间: '02:00', 访问次数: 4 },
              { 时间: '03:00', 访问次数: 1 },
              { 时间: '04:00', 访问次数: 5 },
              { 时间: '05:00', 访问次数: 2 },
              { 时间: '06:00', 访问次数: 8 },
              { 时间: '07:00', 访问次数: 11 },
              { 时间: '08:00', 访问次数: 2 },
              { 时间: '09:00', 访问次数: 15 },
              { 时间: '10:00', 访问次数: 27 },
              { 时间: '11:00', 访问次数: 10 },
              { 时间: '12:00', 访问次数: 39 },
              { 时间: '13:00', 访问次数: 26 },
              { 时间: '14:00', 访问次数: 15 },
              { 时间: '15:00', 访问次数: 23 },
              { 时间: '16:00', 访问次数: 17 },
              { 时间: '17:00', 访问次数: 28 },
              { 时间: '18:00', 访问次数: 33 },
              { 时间: '19:00', 访问次数: 14 },
              { 时间: '20:00', 访问次数: 25 },
              { 时间: '21:00', 访问次数: 7 },
              { 时间: '22:00', 访问次数: 19 },
              { 时间: '23:00', 访问次数: 23 }
            ]
          },
          week: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '周一', 访问次数: 150 },
              { 时间: '周二', 访问次数: 223 },
              { 时间: '周三', 访问次数: 351 },
              { 时间: '周四', 访问次数: 156 },
              { 时间: '周五', 访问次数: 257 },
              { 时间: '周六', 访问次数: 156 },
              { 时间: '周日', 访问次数: 125 }
            ]
          },
          month: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '1号', 访问次数: 100 },
              { 时间: '2号', 访问次数: 154 },
              { 时间: '3号', 访问次数: 224 },
              { 时间: '4号', 访问次数: 123 },
              { 时间: '5号', 访问次数: 142 },
              { 时间: '6号', 访问次数: 56 },
              { 时间: '7号', 访问次数: 17 },
              { 时间: '8号', 访问次数: 250 },
              { 时间: '9号', 访问次数: 145 },
              { 时间: '10号', 访问次数: 154 },
              { 时间: '11号', 访问次数: 128 },
              { 时间: '12号', 访问次数: 66 },
              { 时间: '13号', 访问次数: 88 },
              { 时间: '14号', 访问次数: 174 },
              { 时间: '15号', 访问次数: 169 },
              { 时间: '16号', 访问次数: 104 },
              { 时间: '17号', 访问次数: 2456 },
              { 时间: '18号', 访问次数: 197 },
              { 时间: '19号', 访问次数: 264 },
              { 时间: '20号', 访问次数: 178 },
              { 时间: '21号', 访问次数: 256 },
              { 时间: '22号', 访问次数: 231 },
              { 时间: '23号', 访问次数: 125 },
              { 时间: '24号', 访问次数: 197 },
              { 时间: '25号', 访问次数: 66 },
              { 时间: '26号', 访问次数: 198 },
              { 时间: '27号', 访问次数: 23 },
              { 时间: '28号', 访问次数: 4521 },
              { 时间: '29号', 访问次数: 147 },
              { 时间: '30号', 访问次数: 155 }
            ]
          },
          year: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '1月', 访问次数: 12461 },
              { 时间: '2月', 访问次数: 9654 },
              { 时间: '3月', 访问次数: 6956 },
              { 时间: '4月', 访问次数: 15854 },
              { 时间: '5月', 访问次数: 10136 },
              { 时间: '6月', 访问次数: 9456 },
              { 时间: '7月', 访问次数: 11240 },
              { 时间: '8月', 访问次数: 8946 },
              { 时间: '9月', 访问次数: 12364 },
              { 时间: '10月', 访问次数: 9986 },
              { 时间: '11月', 访问次数: 15123 },
              { 时间: '12月', 访问次数: 10298 }
            ]
          }
        },
        hos2Data: {
          day: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '00:00', 访问次数: 11 },
              { 时间: '01:00', 访问次数: 23 },
              { 时间: '02:00', 访问次数: 11 },
              { 时间: '03:00', 访问次数: 2 },
              { 时间: '04:00', 访问次数: 55 },
              { 时间: '05:00', 访问次数: 12 },
              { 时间: '06:00', 访问次数: 51 },
              { 时间: '07:00', 访问次数: 1 },
              { 时间: '08:00', 访问次数: 5 },
              { 时间: '09:00', 访问次数: 45 },
              { 时间: '10:00', 访问次数: 22 },
              { 时间: '11:00', 访问次数: 37 },
              { 时间: '12:00', 访问次数: 2 },
              { 时间: '13:00', 访问次数: 19 },
              { 时间: '14:00', 访问次数: 23 },
              { 时间: '15:00', 访问次数: 29 },
              { 时间: '16:00', 访问次数: 24 },
              { 时间: '17:00', 访问次数: 37 },
              { 时间: '18:00', 访问次数: 15 },
              { 时间: '19:00', 访问次数: 26 },
              { 时间: '20:00', 访问次数: 25 },
              { 时间: '21:00', 访问次数: 32 },
              { 时间: '22:00', 访问次数: 54 },
              { 时间: '23:00', 访问次数: 26 }
            ]
          },
          week: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '周一', 访问次数: 124 },
              { 时间: '周二', 访问次数: 551 },
              { 时间: '周三', 访问次数: 467 },
              { 时间: '周四', 访问次数: 421 },
              { 时间: '周五', 访问次数: 214 },
              { 时间: '周六', 访问次数: 375 },
              { 时间: '周日', 访问次数: 568 }
            ]
          },
          month: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '1号', 访问次数: 1234 },
              { 时间: '2号', 访问次数: 851 },
              { 时间: '3号', 访问次数: 567 },
              { 时间: '4号', 访问次数: 521 },
              { 时间: '5号', 访问次数: 1014 },
              { 时间: '6号', 访问次数: 975 },
              { 时间: '7号', 访问次数: 468 },
              { 时间: '8号', 访问次数: 365 },
              { 时间: '9号', 访问次数: 289 },
              { 时间: '10号', 访问次数: 593 },
              { 时间: '11号', 访问次数: 547 },
              { 时间: '12号', 访问次数: 206 },
              { 时间: '13号', 访问次数: 620 },
              { 时间: '14号', 访问次数: 97 },
              { 时间: '15号', 访问次数: 92 },
              { 时间: '16号', 访问次数: 23 },
              { 时间: '17号', 访问次数: 256 },
              { 时间: '18号', 访问次数: 392 },
              { 时间: '19号', 访问次数: 14 },
              { 时间: '20号', 访问次数: 236 },
              { 时间: '21号', 访问次数: 45 },
              { 时间: '22号', 访问次数: 301 },
              { 时间: '23号', 访问次数: 214 },
              { 时间: '24号', 访问次数: 106 },
              { 时间: '25号', 访问次数: 124 },
              { 时间: '26号', 访问次数: 551 },
              { 时间: '27号', 访问次数: 567 },
              { 时间: '28号', 访问次数: 451 },
              { 时间: '29号', 访问次数: 204 },
              { 时间: '30号', 访问次数: 475 }
            ]
          },
          year: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '1月', 访问次数: 5234 },
              { 时间: '2月', 访问次数: 7851 },
              { 时间: '3月', 访问次数: 3567 },
              { 时间: '4月', 访问次数: 6521 },
              { 时间: '5月', 访问次数: 3014 },
              { 时间: '6月', 访问次数: 9975 },
              { 时间: '7月', 访问次数: 4568 },
              { 时间: '8月', 访问次数: 6065 },
              { 时间: '9月', 访问次数: 8589 },
              { 时间: '10月', 访问次数: 4593 },
              { 时间: '11月', 访问次数: 5547 },
              { 时间: '12月', 访问次数: 7154 }
            ]
          }
        },
        hos3Data: {
          day: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '00:00', 访问次数: 1 },
              { 时间: '01:00', 访问次数: 5 },
              { 时间: '02:00', 访问次数: 4 },
              { 时间: '03:00', 访问次数: 4 },
              { 时间: '04:00', 访问次数: 2 },
              { 时间: '05:00', 访问次数: 4 },
              { 时间: '06:00', 访问次数: 4 },
              { 时间: '07:00', 访问次数: 3 },
              { 时间: '08:00', 访问次数: 2 },
              { 时间: '09:00', 访问次数: 4 },
              { 时间: '10:00', 访问次数: 5 },
              { 时间: '11:00', 访问次数: 7 },
              { 时间: '12:00', 访问次数: 6 },
              { 时间: '13:00', 访问次数: 9 },
              { 时间: '14:00', 访问次数: 1 },
              { 时间: '15:00', 访问次数: 2 },
              { 时间: '16:00', 访问次数: 2 },
              { 时间: '17:00', 访问次数: 3 },
              { 时间: '18:00', 访问次数: 1 },
              { 时间: '19:00', 访问次数: 2 },
              { 时间: '20:00', 访问次数: 4 },
              { 时间: '21:00', 访问次数: 3 },
              { 时间: '22:00', 访问次数: 2 },
              { 时间: '23:00', 访问次数: 1 }
            ]
          },
          week: {
            columns: ['时间', ' 访问次数'],
            rows: [
              { 时间: '周一', 访问次数: 154 },
              { 时间: '周二', 访问次数: 551 },
              { 时间: '周三', 访问次数: 457 },
              { 时间: '周四', 访问次数: 451 },
              { 时间: '周五', 访问次数: 254 },
              { 时间: '周六', 访问次数: 455 },
              { 时间: '周日', 访问次数: 458 }
            ]
          },
          month: {
            columns: ['时间', ' 访问次数'],
            rows: [
              { 时间: '1号', 访问次数: 234 },
              { 时间: '2号', 访问次数: 851 },
              { 时间: '3号', 访问次数: 567 },
              { 时间: '4号', 访问次数: 521 },
              { 时间: '5号', 访问次数: 14 },
              { 时间: '6号', 访问次数: 975 },
              { 时间: '7号', 访问次数: 568 },
              { 时间: '8号', 访问次数: 65 },
              { 时间: '9号', 访问次数: 589 },
              { 时间: '10号', 访问次数: 593 },
              { 时间: '11号', 访问次数: 547 },
              { 时间: '12号', 访问次数: 14 },
              { 时间: '13号', 访问次数: 520 },
              { 时间: '14号', 访问次数: 87 },
              { 时间: '15号', 访问次数: 982 },
              { 时间: '16号', 访问次数: 923 },
              { 时间: '17号', 访问次数: 456 },
              { 时间: '18号', 访问次数: 792 },
              { 时间: '19号', 访问次数: 514 },
              { 时间: '20号', 访问次数: 436 },
              { 时间: '21号', 访问次数: 125 },
              { 时间: '22号', 访问次数: 201 },
              { 时间: '23号', 访问次数: 514 },
              { 时间: '24号', 访问次数: 26 },
              { 时间: '25号', 访问次数: 234 },
              { 时间: '26号', 访问次数: 851 },
              { 时间: '27号', 访问次数: 567 },
              { 时间: '28号', 访问次数: 521 },
              { 时间: '29号', 访问次数: 14 },
              { 时间: '30号', 访问次数: 975 }
            ]
          },
          year: {
            columns: ['时间', ' 访问次数'],
            rows: [
              { 时间: '1月', 访问次数: 1234 },
              { 时间: '2月', 访问次数: 5251 },
              { 时间: '3月', 访问次数: 4267 },
              { 时间: '4月', 访问次数: 4221 },
              { 时间: '5月', 访问次数: 2214 },
              { 时间: '6月', 访问次数: 4275 },
              { 时间: '7月', 访问次数: 4268 },
              { 时间: '8月', 访问次数: 3265 },
              { 时间: '9月', 访问次数: 2289 },
              { 时间: '10月', 访问次数: 4293 },
              { 时间: '11月', 访问次数: 5247 },
              { 时间: '12月', 访问次数: 724 }
            ]
          }
        },
        hos4Data: {
          day: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '00:00', 访问次数: 1234 },
              { 时间: '01:00', 访问次数: 5851 },
              { 时间: '02:00', 访问次数: 4567 },
              { 时间: '03:00', 访问次数: 4521 },
              { 时间: '04:00', 访问次数: 2014 },
              { 时间: '05:00', 访问次数: 4975 },
              { 时间: '06:00', 访问次数: 4568 },
              { 时间: '07:00', 访问次数: 3065 },
              { 时间: '08:00', 访问次数: 2589 },
              { 时间: '09:00', 访问次数: 4593 },
              { 时间: '10:00', 访问次数: 5547 },
              { 时间: '11:00', 访问次数: 714 },
              { 时间: '12:00', 访问次数: 6520 },
              { 时间: '13:00', 访问次数: 987 },
              { 时间: '14:00', 访问次数: 1982 },
              { 时间: '15:00', 访问次数: 2923 },
              { 时间: '16:00', 访问次数: 2456 },
              { 时间: '17:00', 访问次数: 3792 },
              { 时间: '18:00', 访问次数: 1514 },
              { 时间: '19:00', 访问次数: 2436 },
              { 时间: '20:00', 访问次数: 4125 },
              { 时间: '21:00', 访问次数: 3201 },
              { 时间: '22:00', 访问次数: 2514 },
              { 时间: '23:00', 访问次数: 1026 }
            ]
          },
          week: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '周一', 访问次数: 1234 },
              { 时间: '周二', 访问次数: 5851 },
              { 时间: '周三', 访问次数: 4567 },
              { 时间: '周四', 访问次数: 4521 },
              { 时间: '周五', 访问次数: 2014 },
              { 时间: '周六', 访问次数: 4975 },
              { 时间: '周日', 访问次数: 4568 }
            ]
          },
          month: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '1号', 访问次数: 1234 },
              { 时间: '2号', 访问次数: 5851 },
              { 时间: '3号', 访问次数: 4567 },
              { 时间: '4号', 访问次数: 4521 },
              { 时间: '5号', 访问次数: 2014 },
              { 时间: '6号', 访问次数: 4975 },
              { 时间: '7号', 访问次数: 4568 },
              { 时间: '8号', 访问次数: 3065 },
              { 时间: '9号', 访问次数: 2589 },
              { 时间: '10号', 访问次数: 4593 },
              { 时间: '11号', 访问次数: 5547 },
              { 时间: '12号', 访问次数: 714 },
              { 时间: '13号', 访问次数: 6520 },
              { 时间: '14号', 访问次数: 987 },
              { 时间: '15号', 访问次数: 1982 },
              { 时间: '16号', 访问次数: 2923 },
              { 时间: '17号', 访问次数: 2456 },
              { 时间: '18号', 访问次数: 3792 },
              { 时间: '19号', 访问次数: 1514 },
              { 时间: '20号', 访问次数: 2436 },
              { 时间: '21号', 访问次数: 4125 },
              { 时间: '22号', 访问次数: 3201 },
              { 时间: '23号', 访问次数: 2514 },
              { 时间: '24号', 访问次数: 1026 },
              { 时间: '25号', 访问次数: 1234 },
              { 时间: '26号', 访问次数: 5851 },
              { 时间: '27号', 访问次数: 4567 },
              { 时间: '28号', 访问次数: 4521 },
              { 时间: '29号', 访问次数: 2014 },
              { 时间: '30号', 访问次数: 4975 }
            ]
          },
          year: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '1月', 访问次数: 1234 },
              { 时间: '2月', 访问次数: 5851 },
              { 时间: '3月', 访问次数: 4567 },
              { 时间: '4月', 访问次数: 4521 },
              { 时间: '5月', 访问次数: 2014 },
              { 时间: '6月', 访问次数: 4975 },
              { 时间: '7月', 访问次数: 4568 },
              { 时间: '8月', 访问次数: 3065 },
              { 时间: '9月', 访问次数: 2589 },
              { 时间: '10月', 访问次数: 4593 },
              { 时间: '11月', 访问次数: 5547 },
              { 时间: '12月', 访问次数: 714 }
            ]
          }
        },
        hos5Data: {
          day: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '00:00', 访问次数: 1234 },
              { 时间: '01:00', 访问次数: 5851 },
              { 时间: '02:00', 访问次数: 4567 },
              { 时间: '03:00', 访问次数: 4521 },
              { 时间: '04:00', 访问次数: 2014 },
              { 时间: '05:00', 访问次数: 4975 },
              { 时间: '06:00', 访问次数: 4568 },
              { 时间: '07:00', 访问次数: 3065 },
              { 时间: '08:00', 访问次数: 2589 },
              { 时间: '09:00', 访问次数: 4593 },
              { 时间: '10:00', 访问次数: 5547 },
              { 时间: '11:00', 访问次数: 714 },
              { 时间: '12:00', 访问次数: 6520 },
              { 时间: '13:00', 访问次数: 987 },
              { 时间: '14:00', 访问次数: 1982 },
              { 时间: '15:00', 访问次数: 2923 },
              { 时间: '16:00', 访问次数: 2456 },
              { 时间: '17:00', 访问次数: 3792 },
              { 时间: '18:00', 访问次数: 1514 },
              { 时间: '19:00', 访问次数: 2436 },
              { 时间: '20:00', 访问次数: 4125 },
              { 时间: '21:00', 访问次数: 3201 },
              { 时间: '22:00', 访问次数: 2514 },
              { 时间: '23:00', 访问次数: 1026 }
            ]
          },
          week: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '周一', 访问次数: 1234 },
              { 时间: '周二', 访问次数: 5851 },
              { 时间: '周三', 访问次数: 4567 },
              { 时间: '周四', 访问次数: 4521 },
              { 时间: '周五', 访问次数: 2014 },
              { 时间: '周六', 访问次数: 4975 },
              { 时间: '周日', 访问次数: 4568 }
            ]
          },
          month: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '1号', 访问次数: 1234 },
              { 时间: '2号', 访问次数: 5851 },
              { 时间: '3号', 访问次数: 4567 },
              { 时间: '4号', 访问次数: 4521 },
              { 时间: '5号', 访问次数: 2014 },
              { 时间: '6号', 访问次数: 4975 },
              { 时间: '7号', 访问次数: 4568 },
              { 时间: '8号', 访问次数: 3065 },
              { 时间: '9号', 访问次数: 2589 },
              { 时间: '10号', 访问次数: 4593 },
              { 时间: '11号', 访问次数: 5547 },
              { 时间: '12号', 访问次数: 714 },
              { 时间: '13号', 访问次数: 6520 },
              { 时间: '14号', 访问次数: 987 },
              { 时间: '15号', 访问次数: 1982 },
              { 时间: '16号', 访问次数: 2923 },
              { 时间: '17号', 访问次数: 2456 },
              { 时间: '18号', 访问次数: 3792 },
              { 时间: '19号', 访问次数: 1514 },
              { 时间: '20号', 访问次数: 2436 },
              { 时间: '21号', 访问次数: 4125 },
              { 时间: '22号', 访问次数: 3201 },
              { 时间: '23号', 访问次数: 2514 },
              { 时间: '24号', 访问次数: 1026 },
              { 时间: '25号', 访问次数: 1234 },
              { 时间: '26号', 访问次数: 5851 },
              { 时间: '27号', 访问次数: 4567 },
              { 时间: '28号', 访问次数: 4521 },
              { 时间: '29号', 访问次数: 2014 },
              { 时间: '30号', 访问次数: 4975 }
            ]
          },
          year: {
            columns: ['时间', '访问次数'],
            rows: [
              { 时间: '1月', 访问次数: 1234 },
              { 时间: '2月', 访问次数: 5851 },
              { 时间: '3月', 访问次数: 4567 },
              { 时间: '4月', 访问次数: 4521 },
              { 时间: '5月', 访问次数: 2014 },
              { 时间: '6月', 访问次数: 4975 },
              { 时间: '7月', 访问次数: 4568 },
              { 时间: '8月', 访问次数: 3065 },
              { 时间: '9月', 访问次数: 2589 },
              { 时间: '10月', 访问次数: 4593 },
              { 时间: '11月', 访问次数: 5547 },
              { 时间: '12月', 访问次数: 714 }
            ]
          }
        }
      },
      // page3_mock_data
      databox3list1: {
        item01: "Mysql", item02: "√", item03: "×", item04: "√", item05: "√", item06: "√", item07: "×", item08: "√", item09: "√"
      },
      databox3list2: {
        item01: "MongoDB", item02: "√", item03: "×", item04: "√", item05: "√", item06: "√", item07: "×", item08: "√", item09: "√"
      }

    };
  },
  computed: {
    swiperTop() {
      return this.$refs.swiperTop.swiper;
    }
  },
  mounted() {
    // 头部时间date
    setInterval(() => {
      this.date = moment().format('YYYY-MM-DD  hh:mm:ss');
    }, 1000);
    // console.log('this is current swiper instance object', this.swiperTop);
    // this.swiper.slideTo(1, 1000, false);
    this.chartData01 = this.data01.day;
    this.pieData1.hospital = this.data02.hos_num_pie.day;
    this.pieData1.card = this.data02.card_num_pie.day;
    this.chartData02 = {
      hos1: this.hos_bar_data.hos1Data['day'],
      hos2: this.hos_bar_data.hos2Data['day'],
      hos3: this.hos_bar_data.hos3Data['day'],
      hos4: this.hos_bar_data.hos4Data['day'],
      hos5: this.hos_bar_data.hos5Data['day']
    };
  }
}
</script>
<style scoped>
* {
  margin: 0;
  padding: 0;
}
ul {
  list-style: none;
}
.page_box {
  width: 100%;
  background: url("../assets/images/wrapper-bg.png") no-repeat;
  background-size: 100% 100%;
  border-bottom: 1px solid transparent;
  background-color: #0b0f34;
}
.tabletop {
  width: 100%;
  height: 40px;
}
.tabletop > ul {
  width: 100%;
  height: 30px;
  line-height: 30px;
  display: flex;
  justify-content: space-between;
  align-items: center;
}
.lilastone {
  font-weight: bold;
  font-size: 20px;
  color: #f0f8ff;
  margin-left: 225px;
}
.lilast {
  color: #f0f8ff;
  font-size: 16px;
  margin-right: 50px;
}
.tableheaderone {
  width: 100%;
  height: 50px;
  line-height: 50px;
  display: flex;
  justify-content: space-between;
  font-size: 16px;
}
.tableheaderonea {
  width: 70%;
  color: #f0f8ff;
}
.tableheaderoneb {
  margin-right: 50px;
  color: #f0f8ff;
}
.tableheaderoneb:hover {
  background-color: chocolate;
  cursor: pointer;
  border-radius: 5px;
}
.tableheaderoneas_png {
  margin-left: 20px;
}
.tableheaderoneas {
  margin-left: 10%;
}
.tableheadertwo {
  width: 100%;
  height: 50px;
  line-height: 50px;
  font-size: 16px;
  color: #f0f8ff;
}
.tableheadertwo > ul {
  width: 100%;
  display: flex;
  justify-content: space-around;
  align-items: center;
}
.data_change,
.data_change2 {
  width: 100%;
  height: 20px;
  line-height: 20px;
  font-size: 10px;
  margin: 10px 0;
  color: #f0f8ff;
}
.data_change2 {
  margin-top: 30px;
  width: 100%;
  height: 20px;
  line-height: 20px;
  font-size: 10px;
}
.changebutton_data {
  cursor: pointer;
  margin-left: 12px;
}
.changebutton_data2 {
  cursor: pointer;
  margin-left: 12px;
}
.changebutton_data:hover,
.changebutton_data2:hover {
  background-color: chocolate;
}
.databox {
  width: 100%;
}
.databox_content {
  width: 97.5%;
  margin: 0 auto;
}
.databox_one,
.databox_two {
  width: 100%;
  height: 360px;
  display: flex;
  justify-content: space-between;
  align-items: center;
}
.databoxone_left,
.databoxtwo_left {
  width: 63%;
  height: 340px;
  display: flex;
  justify-content: space-between;
  border: 1px solid black;
  background: url("../assets/images/panel-r-b.png") no-repeat;
  background-size: 100% 100%;
}
.databoxone_right,
.databoxtwo_right {
  width: 35%;
  height: 340px;
  border: 1px solid black;
  background: url("../assets/images/panel-r-b.png") no-repeat;
  background-size: 100% 100%;
}
.databoxoneleft_one,
.databoxtwoleft_one {
  width: 62%;
  height: 340px;
  background: url("../assets/images/panel-r-b.png") no-repeat;
  background-size: 100% 100%;
}
.databoxoneleft_two,
.databoxtwoleft_two {
  width: 35%;
  height: 340px;
  background: url("../assets/images/panel-r-b.png") no-repeat;
  background-size: 100% 100%;
}
.databoxonelefttwo_top,
.databoxtwolefttwo_top {
  width: 100%;
  height: 163px;
  border-left: 1px solid black;
  border-bottom: 1px solid black;
  background: url("../assets/images/panel-r-b.png") no-repeat;
  background-size: 100% 100%;
}
.databoxonelefttwo_bottom,
.databoxtwolefttwo_bottom {
  width: 100%;
  height: 163px;
  margin-top: 14px;
  border-top: 1px solid black;
  border-left: 1px solid black;
  background: url("../assets/images/panel-r-b.png") no-repeat;
  background-size: 100% 100%;
}
.databoxoneright_center,
.databoxtworight_center {
  height: 320px;
  line-height: 320px;
  width: 95%;
  margin: 0 auto;
  margin-top: 10px;
}
.databoxtworight_center_header1 {
  font-size: 10px;
  height: 20px;
  line-height: 20px;
  text-align: center;
}
.databoxtworight_center_header1 > span {
  margin-left: 3px;
  margin-right: 3px;
  color: #f0f8ff;
}
.databoxtworight_center_header1 > span:hover {
  background-color: chocolate;
  cursor: pointer;
}
.databoxtworight_center_header2 {
  font-size: 10px;
  height: 20px;
  line-height: 20px;
  color: #f0f8ff;
}
.databoxtworight_center_header3 {
  height: 340px;
  width: 100%;
}
.databoxtworight_center_header2 > span {
  margin-right: 3px;
}
.databoxtworight_center_header2 > span:hover {
  cursor: pointer;
  background-color: chocolate;
}
/* page3 */
.databox_three {
  width: 100%;
  height: 360px;
  margin-top: 30px;
  margin-bottom: 50px;
  background: url("../assets/images/panel-r-b.png") no-repeat;
  background-size: 100% 100%;
}
.databox_three_top {
  width: 100%;
  height: 50px;
  color: white;
  padding-left: 50px;
  line-height: 50px;
  background: url("../assets/images/title-bg-long.png") no-repeat;
  background-size: 100% 100%;
}
.databox_three_content {
  width: 98%;
  height: 310px;
  margin: 0 auto;
}
.databox_three_contentheader {
  width: 100%;
  height: 20px;
  display: flex;
  justify-content: space-around;
  align-items: center;
  color: white;
  padding-top: 10px;
}
.databox_three_contentdata1,
.databox_three_contentdata2 {
  color: white;
  display: flex;
  align-items: center;
  width: 100%;
  height: 40px;
}
.databox_three_contentdata1 > li:nth-of-type(1) {
  margin-left: 120px;
}
.databox_three_contentdata2 > li:nth-of-type(1) {
  margin-left: 105px;
}
.databox_three_contentdata1 > li:nth-of-type(2) {
  margin-left: 730px;
}
.databox_three_contentdata2 > li:nth-of-type(2) {
  margin-left: 714px;
}
.databox_three_contentdata1 > li:nth-of-type(3) {
  margin-left: 110px;
}
.databox_three_contentdata2 > li:nth-of-type(3) {
  margin-left: 107px;
}
.databox_three_contentdata1 > li:nth-of-type(4) {
  margin-left: 98px;
}
.databox_three_contentdata2 > li:nth-of-type(4) {
  margin-left: 99px;
}
.databox_three_contentdata1 > li:nth-of-type(5) {
  margin-left: 135px;
}
.databox_three_contentdata2 > li:nth-of-type(5) {
  margin-left: 136px;
}
.databox_three_contentdata1 > li:nth-of-type(6) {
  margin-left: 150px;
}
.databox_three_contentdata2 > li:nth-of-type(6) {
  margin-left: 151px;
}
.databox_three_contentdata1 > li:nth-of-type(7) {
  margin-left: 110px;
}
.databox_three_contentdata2 > li:nth-of-type(7) {
  margin-left: 110px;
}
.databox_three_contentdata1 > li:nth-of-type(8) {
  margin-left: 93px;
}
.databox_three_contentdata2 > li:nth-of-type(8) {
  margin-left: 93px;
}
.databox_three_contentdata1 > li:nth-of-type(9) {
  margin-left: 90px;
}
.databox_three_contentdata2 > li:nth-of-type(9) {
  margin-left: 90px;
}
</style>